# InvalidBalustersPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..InvalidBalustersPattern Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Invalid Balusters Pattern
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidBalustersPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidBalustersPattern As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidBalustersPattern {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace